knoopx/pocket-tank/firmware/sdkconfig.defaults
# pocket-tank — Waveshare ESP32-P4-WIFI6-Touch-LCD-4B (4-inch 720x720)
# P4-only build (target esp32p4). WiFi / the ESP32-C6 / esp-hosted /
# esp_wifi_remote are INTENTIONALLY OFF: the tank is offline and the LLM
# runs on-device from flash.

CONFIG_IDF_TARGET="esp32p4"

# 16 MB flash, DIO mode (the 4B's flash + hex PSRAM run DIO at 80 MHz,
# mirroring the ai-display build)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# 32 MB hex (X16) PSRAM at 80 MHz, XIP: app instructions/data live in PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_FLASH_LOAD_TO_PSRAM=y

# RGB565 720x720 ST7703 MIPI-DSI panel (the 4B BSP's DPI path; values mirrored
# from the ai-display skeleton's sdkconfig)
CONFIG_BSP_LCD_TYPE_720_720_4_INCH=y
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=3

# the P4 is RISC-V with no PIE SIMD: scalar LLM kernel (unconditional)

# the 4B's 16 MB custom partition table (8 MB raw model partition)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LVGL 9.6's registry manifest gates its optional codec components (freetype,
# libjpeg-turbo, libpng, lz4) on $CONFIG{LV_USE_*} if-clauses. IDF 5.5's
# component manager raises MissingKconfigError when a symbol is undefined,
# so the symbols are defined here (all off - the tank needs no font/image
# decoders) and the optional components are never selected.
CONFIG_LV_USE_FREETYPE=n
CONFIG_LV_USE_LIBJPEG_TURBO=n
CONFIG_LV_USE_LIBPNG=n
CONFIG_LV_USE_LZ4=n
CONFIG_LV_USE_LZ4_INTERNAL=n
